grevaillot/svd_tools/headers/STM32H7x7_CM4/fdcan2.h
#define FDCAN2_FDCAN_CREL_MON_SHIFT		8
#define FDCAN2_FDCAN_CREL_MON_MASK		0xff
/** @defgroup fdcan2_fdcan_crel_mon MON Timestamp Month
@{*/
/**@}*/


#define FDCAN2_FDCAN_CREL_DAY_SHIFT		0
#define FDCAN2_FDCAN_CREL_DAY_MASK		0xff
/** @defgroup fdcan2_fdcan_crel_day DAY Timestamp Day
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_endn FDCANENDN FDCAN Core Release Register
@{*/


#define FDCAN2_FDCAN_ENDN_ETV_SHIFT		0
#define FDCAN2_FDCAN_ENDN_ETV_MASK		0xffffffff
/** @defgroup fdcan2_fdcan_endn_etv ETV Endiannes Test Value
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_dbtp FDCANDBTP FDCAN Data Bit Timing and Prescaler Register
@{*/

/** FDCAN2_FDCAN_DBTP_TDC Transceiver Delay Compensation **/
#define FDCAN2_FDCAN_DBTP_TDC		(1 << 23)

#define FDCAN2_FDCAN_DBTP_DBRP_SHIFT		16
#define FDCAN2_FDCAN_DBTP_DBRP_MASK		0x1f
/** @defgroup fdcan2_fdcan_dbtp_dbrp DBRP Data BIt Rate Prescaler
@{*/
/**@}*/


#define FDCAN2_FDCAN_DBTP_DTSEG1_SHIFT		8
#define FDCAN2_FDCAN_DBTP_DTSEG1_MASK		0x1f
/** @defgroup fdcan2_fdcan_dbtp_dtseg1 DTSEG1 Data time segment after sample point
@{*/
/**@}*/


#define FDCAN2_FDCAN_DBTP_DTSEG2_SHIFT		4
#define FDCAN2_FDCAN_DBTP_DTSEG2_MASK		0x0f
/** @defgroup fdcan2_fdcan_dbtp_dtseg2 DTSEG2 Data time segment after sample point
@{*/
/**@}*/


#define FDCAN2_FDCAN_DBTP_DSJW_SHIFT		0
#define FDCAN2_FDCAN_DBTP_DSJW_MASK		0x0f
/** @defgroup fdcan2_fdcan_dbtp_dsjw DSJW Synchronization Jump Width
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_test FDCANTEST FDCAN Test Register
@{*/

/** FDCAN2_FDCAN_TEST_RX Control of Transmit Pin **/
#define FDCAN2_FDCAN_TEST_RX		(1 << 7)

#define FDCAN2_FDCAN_TEST_TX_SHIFT		5
#define FDCAN2_FDCAN_TEST_TX_MASK		0x03
/** @defgroup fdcan2_fdcan_test_tx TX Loop Back mode
@{*/
/**@}*/

/** FDCAN2_FDCAN_TEST_LBCK Loop Back mode **/
#define FDCAN2_FDCAN_TEST_LBCK		(1 << 4)

/**@}*/

/** @defgroup fdcan2_fdcan_rwd FDCANRWD FDCAN RAM Watchdog Register
@{*/


#define FDCAN2_FDCAN_RWD_WDV_SHIFT		8
#define FDCAN2_FDCAN_RWD_WDV_MASK		0xff
/** @defgroup fdcan2_fdcan_rwd_wdv WDV Watchdog value
@{*/
/**@}*/


#define FDCAN2_FDCAN_RWD_WDC_SHIFT		0
#define FDCAN2_FDCAN_RWD_WDC_MASK		0xff
/** @defgroup fdcan2_fdcan_rwd_wdc WDC Watchdog configuration
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_cccr FDCANCCCR FDCAN CC Control Register
@{*/

/** FDCAN2_FDCAN_CCCR_NISO Non ISO Operation **/
#define FDCAN2_FDCAN_CCCR_NISO		(1 << 15)
/** FDCAN2_FDCAN_CCCR_TXP TXP **/
#define FDCAN2_FDCAN_CCCR_TXP		(1 << 14)
/** FDCAN2_FDCAN_CCCR_EFBI Edge Filtering during Bus Integration **/
#define FDCAN2_FDCAN_CCCR_EFBI		(1 << 13)
/** FDCAN2_FDCAN_CCCR_PXHD Protocol Exception Handling Disable **/
#define FDCAN2_FDCAN_CCCR_PXHD		(1 << 12)
/** FDCAN2_FDCAN_CCCR_BSE FDCAN Bit Rate Switching **/
#define FDCAN2_FDCAN_CCCR_BSE		(1 << 9)
/** FDCAN2_FDCAN_CCCR_FDOE FD Operation Enable **/
#define FDCAN2_FDCAN_CCCR_FDOE		(1 << 8)
/** FDCAN2_FDCAN_CCCR_TEST Test Mode Enable **/
#define FDCAN2_FDCAN_CCCR_TEST		(1 << 7)
/** FDCAN2_FDCAN_CCCR_DAR Disable Automatic Retransmission **/
#define FDCAN2_FDCAN_CCCR_DAR		(1 << 6)
/** FDCAN2_FDCAN_CCCR_MON Bus Monitoring Mode **/
#define FDCAN2_FDCAN_CCCR_MON		(1 << 5)
/** FDCAN2_FDCAN_CCCR_CSR Clock Stop Request **/
#define FDCAN2_FDCAN_CCCR_CSR		(1 << 4)
/** FDCAN2_FDCAN_CCCR_CSA Clock Stop Acknowledge **/
#define FDCAN2_FDCAN_CCCR_CSA		(1 << 3)
/** FDCAN2_FDCAN_CCCR_ASM ASM Restricted Operation Mode **/
#define FDCAN2_FDCAN_CCCR_ASM		(1 << 2)
/** FDCAN2_FDCAN_CCCR_CCE Configuration Change Enable **/
#define FDCAN2_FDCAN_CCCR_CCE		(1 << 1)
/** FDCAN2_FDCAN_CCCR_INIT Initialization **/
#define FDCAN2_FDCAN_CCCR_INIT		(1 << 0)

/**@}*/

/** @defgroup fdcan2_fdcan_nbtp FDCANNBTP FDCAN Nominal Bit Timing and Prescaler Register
@{*/


#define FDCAN2_FDCAN_NBTP_NSJW_SHIFT		25
#define FDCAN2_FDCAN_NBTP_NSJW_MASK		0x7f
/** @defgroup fdcan2_fdcan_nbtp_nsjw NSJW NSJW: Nominal (Re)Synchronization Jump Width
@{*/
/**@}*/


#define FDCAN2_FDCAN_NBTP_NBRP_SHIFT		16
#define FDCAN2_FDCAN_NBTP_NBRP_MASK		0x1ff
/** @defgroup fdcan2_fdcan_nbtp_nbrp NBRP Bit Rate Prescaler
@{*/
/**@}*/


#define FDCAN2_FDCAN_NBTP_NTSEG1_SHIFT		8
#define FDCAN2_FDCAN_NBTP_NTSEG1_MASK		0xff
/** @defgroup fdcan2_fdcan_nbtp_ntseg1 NTSEG1 Nominal Time segment before sample point
@{*/
/**@}*/


#define FDCAN2_FDCAN_NBTP_TSEG2_SHIFT		0
#define FDCAN2_FDCAN_NBTP_TSEG2_MASK		0x7f
/** @defgroup fdcan2_fdcan_nbtp_tseg2 TSEG2 Nominal Time segment after sample point
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_tscc FDCANTSCC FDCAN Timestamp Counter Configuration Register
@{*/


#define FDCAN2_FDCAN_TSCC_TCP_SHIFT		16
#define FDCAN2_FDCAN_TSCC_TCP_MASK		0x0f
/** @defgroup fdcan2_fdcan_tscc_tcp TCP Timestamp Counter Prescaler
@{*/
/**@}*/


#define FDCAN2_FDCAN_TSCC_TSS_SHIFT		0
#define FDCAN2_FDCAN_TSCC_TSS_MASK		0x03
/** @defgroup fdcan2_fdcan_tscc_tss TSS Timestamp Select
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_tscv FDCANTSCV FDCAN Timestamp Counter Value Register
@{*/


#define FDCAN2_FDCAN_TSCV_TSC_SHIFT		0
#define FDCAN2_FDCAN_TSCV_TSC_MASK		0xffff
/** @defgroup fdcan2_fdcan_tscv_tsc TSC Timestamp Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_tocc FDCANTOCC FDCAN Timeout Counter Configuration Register
@{*/


#define FDCAN2_FDCAN_TOCC_TOP_SHIFT		16
#define FDCAN2_FDCAN_TOCC_TOP_MASK		0xffff
/** @defgroup fdcan2_fdcan_tocc_top TOP Timeout Period
@{*/
/**@}*/


#define FDCAN2_FDCAN_TOCC_TOS_SHIFT		1
#define FDCAN2_FDCAN_TOCC_TOS_MASK		0x03
/** @defgroup fdcan2_fdcan_tocc_tos TOS Timeout Select
@{*/
/**@}*/

/** FDCAN2_FDCAN_TOCC_ETOC Enable Timeout Counter **/
#define FDCAN2_FDCAN_TOCC_ETOC		(1 << 0)

/**@}*/

/** @defgroup fdcan2_fdcan_tocv FDCANTOCV FDCAN Timeout Counter Value Register
@{*/


#define FDCAN2_FDCAN_TOCV_TOC_SHIFT		0
#define FDCAN2_FDCAN_TOCV_TOC_MASK		0xffff
/** @defgroup fdcan2_fdcan_tocv_toc TOC Timeout Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_ecr FDCANECR FDCAN Error Counter Register
@{*/


#define FDCAN2_FDCAN_ECR_CEL_SHIFT		16
#define FDCAN2_FDCAN_ECR_CEL_MASK		0xff
/** @defgroup fdcan2_fdcan_ecr_cel CEL AN Error Logging
@{*/
/**@}*/

/** FDCAN2_FDCAN_ECR_RP Receive Error Passive **/
#define FDCAN2_FDCAN_ECR_RP		(1 << 15)

#define FDCAN2_FDCAN_ECR_TREC_SHIFT		8
#define FDCAN2_FDCAN_ECR_TREC_MASK		0x7f
/** @defgroup fdcan2_fdcan_ecr_trec TREC Receive Error Counter
@{*/
/**@}*/


