grevaillot/svd_tools/headers/STM32H7x7_CM4/fdcan2.h
/** @defgroup fdcan2_fdcan_rxesc FDCANRXESC FDCAN Rx Buffer Element Size Configuration Register
@{*/


#define FDCAN2_FDCAN_RXESC_RBDS_SHIFT		8
#define FDCAN2_FDCAN_RXESC_RBDS_MASK		0x07
/** @defgroup fdcan2_fdcan_rxesc_rbds RBDS Rx Buffer Data Field Size:
@{*/
/**@}*/


#define FDCAN2_FDCAN_RXESC_F1DS_SHIFT		4
#define FDCAN2_FDCAN_RXESC_F1DS_MASK		0x07
/** @defgroup fdcan2_fdcan_rxesc_f1ds F1DS Rx FIFO 0 Data Field Size:
@{*/
/**@}*/


#define FDCAN2_FDCAN_RXESC_F0DS_SHIFT		0
#define FDCAN2_FDCAN_RXESC_F0DS_MASK		0x07
/** @defgroup fdcan2_fdcan_rxesc_f0ds F0DS Rx FIFO 1 Data Field Size:
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_txbc FDCANTXBC FDCAN Tx Buffer Configuration Register
@{*/

/** FDCAN2_FDCAN_TXBC_TFQM Tx FIFO/Queue Mode **/
#define FDCAN2_FDCAN_TXBC_TFQM		(1 << 30)

#define FDCAN2_FDCAN_TXBC_TFQS_SHIFT		24
#define FDCAN2_FDCAN_TXBC_TFQS_MASK		0x3f
/** @defgroup fdcan2_fdcan_txbc_tfqs TFQS Transmit FIFO/Queue Size
@{*/
/**@}*/


#define FDCAN2_FDCAN_TXBC_NDTB_SHIFT		16
#define FDCAN2_FDCAN_TXBC_NDTB_MASK		0x3f
/** @defgroup fdcan2_fdcan_txbc_ndtb NDTB Number of Dedicated Transmit Buffers
@{*/
/**@}*/


#define FDCAN2_FDCAN_TXBC_TBSA_SHIFT		2
#define FDCAN2_FDCAN_TXBC_TBSA_MASK		0x3fff
/** @defgroup fdcan2_fdcan_txbc_tbsa TBSA Tx Buffers Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_txfqs FDCANTXFQS FDCAN Tx FIFO/Queue Status Register
@{*/

/** FDCAN2_FDCAN_TXFQS_TFQF Tx FIFO/Queue Full **/
#define FDCAN2_FDCAN_TXFQS_TFQF		(1 << 21)

#define FDCAN2_FDCAN_TXFQS_TFQPI_SHIFT		16
#define FDCAN2_FDCAN_TXFQS_TFQPI_MASK		0x1f
/** @defgroup fdcan2_fdcan_txfqs_tfqpi TFQPI Tx FIFO/Queue Put Index
@{*/
/**@}*/


#define FDCAN2_FDCAN_TXFQS_TFGI_SHIFT		8
#define FDCAN2_FDCAN_TXFQS_TFGI_MASK		0x1f
/** @defgroup fdcan2_fdcan_txfqs_tfgi TFGI TFGI
@{*/
/**@}*/


#define FDCAN2_FDCAN_TXFQS_TFFL_SHIFT		0
#define FDCAN2_FDCAN_TXFQS_TFFL_MASK		0x3f
/** @defgroup fdcan2_fdcan_txfqs_tffl TFFL Tx FIFO Free Level
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_txesc FDCANTXESC FDCAN Tx Buffer Element Size Configuration Register
@{*/


#define FDCAN2_FDCAN_TXESC_TBDS_SHIFT		0
#define FDCAN2_FDCAN_TXESC_TBDS_MASK		0x07
/** @defgroup fdcan2_fdcan_txesc_tbds TBDS Tx Buffer Data Field Size:
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_txbrp FDCANTXBRP FDCAN Tx Buffer Request Pending Register
@{*/


#define FDCAN2_FDCAN_TXBRP_TRP_SHIFT		0
#define FDCAN2_FDCAN_TXBRP_TRP_MASK		0xffffffff
/** @defgroup fdcan2_fdcan_txbrp_trp TRP Transmission Request Pending
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_txbar FDCANTXBAR FDCAN Tx Buffer Add Request Register
@{*/


#define FDCAN2_FDCAN_TXBAR_AR_SHIFT		0
#define FDCAN2_FDCAN_TXBAR_AR_MASK		0xffffffff
/** @defgroup fdcan2_fdcan_txbar_ar AR Add Request
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_txbcr FDCANTXBCR FDCAN Tx Buffer Cancellation Request Register
@{*/


#define FDCAN2_FDCAN_TXBCR_CR_SHIFT		0
#define FDCAN2_FDCAN_TXBCR_CR_MASK		0xffffffff
/** @defgroup fdcan2_fdcan_txbcr_cr CR Cancellation Request
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_txbto FDCANTXBTO FDCAN Tx Buffer Transmission Occurred Register
@{*/


#define FDCAN2_FDCAN_TXBTO_TO_SHIFT		0
#define FDCAN2_FDCAN_TXBTO_TO_MASK		0xffffffff
/** @defgroup fdcan2_fdcan_txbto_to TO Transmission Occurred.
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_txbcf FDCANTXBCF FDCAN Tx Buffer Cancellation Finished Register
@{*/


#define FDCAN2_FDCAN_TXBCF_CF_SHIFT		0
#define FDCAN2_FDCAN_TXBCF_CF_MASK		0xffffffff
/** @defgroup fdcan2_fdcan_txbcf_cf CF Cancellation Finished
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_txbtie FDCANTXBTIE FDCAN Tx Buffer Transmission Interrupt Enable Register
@{*/


#define FDCAN2_FDCAN_TXBTIE_TIE_SHIFT		0
#define FDCAN2_FDCAN_TXBTIE_TIE_MASK		0xffffffff
/** @defgroup fdcan2_fdcan_txbtie_tie TIE Transmission Interrupt Enable
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_txbcie FDCANTXBCIE FDCAN Tx Buffer Cancellation Finished Interrupt Enable Register
@{*/


#define FDCAN2_FDCAN_TXBCIE_CF_SHIFT		0
#define FDCAN2_FDCAN_TXBCIE_CF_MASK		0xffffffff
/** @defgroup fdcan2_fdcan_txbcie_cf CF Cancellation Finished Interrupt Enable
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_txefc FDCANTXEFC FDCAN Tx Event FIFO Configuration Register
@{*/


#define FDCAN2_FDCAN_TXEFC_EFWM_SHIFT		24
#define FDCAN2_FDCAN_TXEFC_EFWM_MASK		0x3f
/** @defgroup fdcan2_fdcan_txefc_efwm EFWM Event FIFO Watermark
@{*/
/**@}*/


#define FDCAN2_FDCAN_TXEFC_EFS_SHIFT		16
#define FDCAN2_FDCAN_TXEFC_EFS_MASK		0x3f
/** @defgroup fdcan2_fdcan_txefc_efs EFS Event FIFO Size
@{*/
/**@}*/


#define FDCAN2_FDCAN_TXEFC_EFSA_SHIFT		2
#define FDCAN2_FDCAN_TXEFC_EFSA_MASK		0x3fff
/** @defgroup fdcan2_fdcan_txefc_efsa EFSA Event FIFO Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_txefs FDCANTXEFS FDCAN Tx Event FIFO Status Register
@{*/

/** FDCAN2_FDCAN_TXEFS_TEFL Tx Event FIFO Element Lost. **/
#define FDCAN2_FDCAN_TXEFS_TEFL		(1 << 25)
/** FDCAN2_FDCAN_TXEFS_EFF Event FIFO Full. **/
#define FDCAN2_FDCAN_TXEFS_EFF		(1 << 24)

#define FDCAN2_FDCAN_TXEFS_EFGI_SHIFT		8
#define FDCAN2_FDCAN_TXEFS_EFGI_MASK		0x1f
/** @defgroup fdcan2_fdcan_txefs_efgi EFGI Event FIFO Get Index.
@{*/
/**@}*/


#define FDCAN2_FDCAN_TXEFS_EFFL_SHIFT		0
#define FDCAN2_FDCAN_TXEFS_EFFL_MASK		0x3f
/** @defgroup fdcan2_fdcan_txefs_effl EFFL Event FIFO Fill Level
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_txefa FDCANTXEFA FDCAN Tx Event FIFO Acknowledge Register
@{*/


#define FDCAN2_FDCAN_TXEFA_EFAI_SHIFT		0
#define FDCAN2_FDCAN_TXEFA_EFAI_MASK		0x1f
/** @defgroup fdcan2_fdcan_txefa_efai EFAI Event FIFO Acknowledge Index
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_tttmc FDCANTTTMC FDCAN TT Trigger Memory Configuration Register
@{*/


#define FDCAN2_FDCAN_TTTMC_TME_SHIFT		16
#define FDCAN2_FDCAN_TTTMC_TME_MASK		0x7f
/** @defgroup fdcan2_fdcan_tttmc_tme TME Trigger Memory Elements
@{*/
/**@}*/


#define FDCAN2_FDCAN_TTTMC_TMSA_SHIFT		2
#define FDCAN2_FDCAN_TTTMC_TMSA_MASK		0x3fff
/** @defgroup fdcan2_fdcan_tttmc_tmsa TMSA Trigger Memory Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_ttrmc FDCANTTRMC FDCAN TT Reference Message Configuration Register
@{*/

/** FDCAN2_FDCAN_TTRMC_RMPS Reference Message Payload Select **/
#define FDCAN2_FDCAN_TTRMC_RMPS		(1 << 31)
/** FDCAN2_FDCAN_TTRMC_XTD Extended Identifier **/
#define FDCAN2_FDCAN_TTRMC_XTD		(1 << 30)

