grevaillot/svd_tools/headers/STM32H7x7_CM4/fdcan2.h
#define FDCAN2_FDCAN_TTOST_RTO_SHIFT		8
#define FDCAN2_FDCAN_TTOST_RTO_MASK		0xff
/** @defgroup fdcan2_fdcan_ttost_rto RTO Reference Trigger Offset
@{*/
/**@}*/

/** FDCAN2_FDCAN_TTOST_QCS Quality of Clock Speed **/
#define FDCAN2_FDCAN_TTOST_QCS		(1 << 7)
/** FDCAN2_FDCAN_TTOST_GTP Quality of Global Time Phase **/
#define FDCAN2_FDCAN_TTOST_GTP		(1 << 6)

#define FDCAN2_FDCAN_TTOST_SYS_SHIFT		4
#define FDCAN2_FDCAN_TTOST_SYS_MASK		0x03
/** @defgroup fdcan2_fdcan_ttost_sys SYS Synchronization State
@{*/
/**@}*/


#define FDCAN2_FDCAN_TTOST_MS_SHIFT		2
#define FDCAN2_FDCAN_TTOST_MS_MASK		0x03
/** @defgroup fdcan2_fdcan_ttost_ms MS Master State.
@{*/
/**@}*/


#define FDCAN2_FDCAN_TTOST_EL_SHIFT		0
#define FDCAN2_FDCAN_TTOST_EL_MASK		0x03
/** @defgroup fdcan2_fdcan_ttost_el EL Error Level
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_turna FDCANTURNA FDCAN TUR Numerator Actual Register
@{*/


#define FDCAN2_FDCAN_TURNA_NAV_SHIFT		0
#define FDCAN2_FDCAN_TURNA_NAV_MASK		0x3ffff
/** @defgroup fdcan2_fdcan_turna_nav NAV Numerator Actual Value
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_ttlgt FDCANTTLGT FDCAN TT Local and Global Time Register
@{*/


#define FDCAN2_FDCAN_TTLGT_GT_SHIFT		16
#define FDCAN2_FDCAN_TTLGT_GT_MASK		0xffff
/** @defgroup fdcan2_fdcan_ttlgt_gt GT Global Time
@{*/
/**@}*/


#define FDCAN2_FDCAN_TTLGT_LT_SHIFT		0
#define FDCAN2_FDCAN_TTLGT_LT_MASK		0xffff
/** @defgroup fdcan2_fdcan_ttlgt_lt LT Local Time
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_ttctc FDCANTTCTC FDCAN TT Cycle Time and Count Register
@{*/


#define FDCAN2_FDCAN_TTCTC_CC_SHIFT		16
#define FDCAN2_FDCAN_TTCTC_CC_MASK		0x3f
/** @defgroup fdcan2_fdcan_ttctc_cc CC Cycle Count
@{*/
/**@}*/


#define FDCAN2_FDCAN_TTCTC_CT_SHIFT		0
#define FDCAN2_FDCAN_TTCTC_CT_MASK		0xffff
/** @defgroup fdcan2_fdcan_ttctc_ct CT Cycle Time
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_ttcpt FDCANTTCPT FDCAN TT Capture Time Register
@{*/


#define FDCAN2_FDCAN_TTCPT_SWV_SHIFT		16
#define FDCAN2_FDCAN_TTCPT_SWV_MASK		0xffff
/** @defgroup fdcan2_fdcan_ttcpt_swv SWV Stop Watch Value
@{*/
/**@}*/


#define FDCAN2_FDCAN_TTCPT_CT_SHIFT		0
#define FDCAN2_FDCAN_TTCPT_CT_MASK		0x3f
/** @defgroup fdcan2_fdcan_ttcpt_ct CT Cycle Count Value
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_ttcsm FDCANTTCSM FDCAN TT Cycle Sync Mark Register
@{*/


#define FDCAN2_FDCAN_TTCSM_CSM_SHIFT		0
#define FDCAN2_FDCAN_TTCSM_CSM_MASK		0xffff
/** @defgroup fdcan2_fdcan_ttcsm_csm CSM Cycle Sync Mark
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_ttts FDCANTTTS FDCAN TT Trigger Select Register
@{*/


#define FDCAN2_FDCAN_TTTS_EVTSEL_SHIFT		4
#define FDCAN2_FDCAN_TTTS_EVTSEL_MASK		0x03
/** @defgroup fdcan2_fdcan_ttts_evtsel EVTSEL Event trigger input selection
@{*/
/**@}*/


#define FDCAN2_FDCAN_TTTS_SWTDEL_SHIFT		0
#define FDCAN2_FDCAN_TTTS_SWTDEL_MASK		0x03
/** @defgroup fdcan2_fdcan_ttts_swtdel SWTDEL Stop watch trigger input selection
@{*/
/**@}*/


/**@}*/
